In [258]:
%matplotlib inline
import matplotlib.pyplot as plt
import pandas as pd
import statsmodels.api as sm
import pylab as pl
import numpy as np

In [259]:
df_train_set = pd.read_csv("Adult_Data_Test.csv")
df_test_set = pd.read_csv("Adult_Data_Train.csv")

In [260]:
df_train_set.head()

,age,workingclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,Over_Under_50K
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K.
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K.
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K.
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K.
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K.

In [261]:
df_train_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16281 entries, 0 to 16280
Data columns (total 15 columns):
age                16281 non-null int64
 workingclass      16281 non-null object
 fnlwgt            16281 non-null int64
 education         16281 non-null object
 education_num     16281 non-null int64
 marital_status    16281 non-null object
 occupation        16281 non-null object
 relationship      16281 non-null object
 race              16281 non-null object
 sex               16281 non-null object
 capital_gain      16281 non-null int64
 capital_loss      16281 non-null int64
 hours_per_week    16281 non-null int64
 native_country    16281 non-null object
 Over_Under_50K    16281 non-null object
dtypes: int64(6), object(9)
memory usage: 1.9+ MB

In [262]:
df_train = df_train_set.dropna()

In [263]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 16281 entries, 0 to 16280
Data columns (total 15 columns):
age                16281 non-null int64
 workingclass      16281 non-null object
 fnlwgt            16281 non-null int64
 education         16281 non-null object
 education_num     16281 non-null int64
 marital_status    16281 non-null object
 occupation        16281 non-null object
 relationship      16281 non-null object
 race              16281 non-null object
 sex               16281 non-null object
 capital_gain      16281 non-null int64
 capital_loss      16281 non-null int64
 hours_per_week    16281 non-null int64
 native_country    16281 non-null object
 Over_Under_50K    16281 non-null object
dtypes: int64(6), object(9)
memory usage: 2.0+ MB

In [264]:
df_train.columns = [x.strip()for x in df_train.columns]

In [265]:
list(df_train)

['age',
 'workingclass',
 'fnlwgt',
 'education',
 'education_num',
 'marital_status',
 'occupation',
 'relationship',
 'race',
 'sex',
 'capital_gain',
 'capital_loss',
 'hours_per_week',
 'native_country',
 'Over_Under_50K']

In [266]:
##Frequency table of education and Over_Under_50K

In [267]:
EduGroup = df_train.groupby(['education','Over_Under_50K'])

In [268]:
EduGroup.size()

education      Over_Under_50K
 10th           <=50K.            431
                >50K.              25
 11th           <=50K.            605
                >50K.              32
 12th           <=50K.            209
                >50K.              15
 1st-4th        <=50K.             77
                >50K.               2
 5th-6th        <=50K.            165
                >50K.              11
 7th-8th        <=50K.            287
                >50K.              22
 9th            <=50K.            228
                >50K.              14
 Assoc-acdm     <=50K.            386
                >50K.             148
 Assoc-voc      <=50K.            518
                >50K.             161
 Bachelors      <=50K.           1578
                >50K.            1092
 Doctorate      <=50K.             56
                >50K.             125
 HS-grad        <=50K.           4455
                >50K.             828
 Masters        <=50K.            434
                >50K.             500
 Preschool      <=50K.             31
                >50K.               1
 Prof-school    <=50K.             64
                >50K.             194
 Some-college   <=50K.           2911
                >50K.             676
dtype: int64

In [269]:
RaceGroup = df_train.groupby(['race','Over_Under_50K'])

In [270]:
RaceGroup.size()

race                 Over_Under_50K
 Amer-Indian-Eskimo   <=50K.             140
                      >50K.               19
 Asian-Pac-Islander   <=50K.             347
                      >50K.              133
 Black                <=50K.            1382
                      >50K.              179
 Other                <=50K.             110
                      >50K.               25
 White                <=50K.           10456
                      >50K.             3490
dtype: int64

In [271]:
SexGroup = df_train.groupby(['sex','Over_Under_50K'])

In [272]:
SexGroup.size()

sex      Over_Under_50K
 Female   <=50K.           4831
          >50K.             590
 Male     <=50K.           7604
          >50K.            3256
dtype: int64

In [273]:
##Create Dummy variables for race and sex

In [274]:
SexDummies = pd.get_dummies(df_train.sex)

In [275]:
SexDummies.head()

    Female   Male
0        0      1
1        0      1
2        0      1
3        0      1
4        1      0

In [276]:
RaceDummies = pd.get_dummies(df_train.race)

In [277]:
RaceDummies.head()

    Amer-Indian-Eskimo   Asian-Pac-Islander   Black   Other   White
0                    0                    0       1       0       0
1                    0                    0       0       0       1
2                    0                    0       0       0       1
3                    0                    0       1       0       0
4                    0                    0       0       0       1

In [278]:
Over50KDummies = pd.get_dummies(df_train.Over_Under_50K)

In [279]:
Over50KDummies.head()

    <=50K.   >50K.
0        1       0
1        1       0
2        0       1
3        0       1
4        1       0

In [280]:
EducationDummies = pd.get_dummies(df_train.education)

In [281]:
EducationDummies.head()

,10th,11th,12th,1st-4th,5th-6th,7th-8th,9th,Assoc-acdm,Assoc-voc,Bachelors,Doctorate,HS-grad,Masters,Preschool,Prof-school,Some-college
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
2,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1
4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1

In [283]:
df_train.head()

,age,workingclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,Over_Under_50K
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K.
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K.
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K.
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K.
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K.

In [356]:
MarriageDummies = pd.get_dummies(df_train.marital_status)

In [357]:
MarriageDummies.head()

,Divorced,Married-AF-spouse,Married-civ-spouse,Married-spouse-absent,Never-married,Separated,Widowed
0,0,0,0,0,1,0,0
1,0,0,1,0,0,0,0
2,0,0,1,0,0,0,0
3,0,0,1,0,0,0,0
4,0,0,0,0,1,0,0

In [358]:
cols_to_keep = ['age', 'capital_gain', 'capital_loss', 'hours_per_week']
handCalc = df_train[cols_to_keep].join(SexDummies.loc[:,' Female']).join(RaceDummies.loc[:]).join(Over50KDummies).join(EducationDummies.loc[:].join(MarriageDummies.loc[:]))
handCalc.head()

,age,capital_gain,capital_loss,hours_per_week,Female,Amer-Indian-Eskimo,Asian-Pac-Islander,Black,Other,White,...,Preschool,Prof-school,Some-college,Divorced,Married-AF-spouse,Married-civ-spouse,Married-spouse-absent,Never-married,Separated,Widowed
0,25,0,0,40,0,0,0,1,0,0,...,0,0,0,0,0,0,0,1,0,0
1,38,0,0,50,0,0,0,0,0,1,...,0,0,0,0,0,1,0,0,0,0
2,28,0,0,40,0,0,0,0,0,1,...,0,0,0,0,0,1,0,0,0,0
3,44,7688,0,40,0,0,0,1,0,0,...,0,0,1,0,0,1,0,0,0,0
4,18,0,0,30,1,0,0,0,0,1,...,0,0,1,0,0,0,0,1,0,0

In [359]:
list(handCalc)

['age',
 'capital_gain',
 'capital_loss',
 'hours_per_week',
 ' Female',
 ' Amer-Indian-Eskimo',
 ' Asian-Pac-Islander',
 ' Black',
 ' Other',
 ' White',
 ' <=50K.',
 ' >50K.',
 ' 10th',
 ' 11th',
 ' 12th',
 ' 1st-4th',
 ' 5th-6th',
 ' 7th-8th',
 ' 9th',
 ' Assoc-acdm',
 ' Assoc-voc',
 ' Bachelors',
 ' Doctorate',
 ' HS-grad',
 ' Masters',
 ' Preschool',
 ' Prof-school',
 ' Some-college',
 ' Divorced',
 ' Married-AF-spouse',
 ' Married-civ-spouse',
 ' Married-spouse-absent',
 ' Never-married',
 ' Separated',
 ' Widowed']

In [360]:
handCalc.columns = [x.strip()for x in handCalc.columns]

In [361]:
list(handCalc)

['age',
 'capital_gain',
 'capital_loss',
 'hours_per_week',
 'Female',
 'Amer-Indian-Eskimo',
 'Asian-Pac-Islander',
 'Black',
 'Other',
 'White',
 '<=50K.',
 '>50K.',
 '10th',
 '11th',
 '12th',
 '1st-4th',
 '5th-6th',
 '7th-8th',
 '9th',
 'Assoc-acdm',
 'Assoc-voc',
 'Bachelors',
 'Doctorate',
 'HS-grad',
 'Masters',
 'Preschool',
 'Prof-school',
 'Some-college',
 'Divorced',
 'Married-AF-spouse',
 'Married-civ-spouse',
 'Married-spouse-absent',
 'Never-married',
 'Separated',
 'Widowed']

In [289]:
## Crosstab Female with Over_Under_50K

In [365]:
pd.crosstab(handCalc['>50K.'], handCalc['Female'])

Female     0     1
>50K.
0       7604  4831
1       3256   590

In [366]:
## Crosstab Female with Over_Under_50K by education level

In [367]:
pd.crosstab(handCalc['>50K.'], handCalc['Female'], rownames = ['>50K.'])

Female     0     1
>50K.
0       7604  4831
1       3256   590

In [368]:
## Odds of being a woman making over $50K

In [369]:
Bach_50f = 590/3846
Bach_50f

0.15340613624544983

In [370]:
## Odds of NOT being a woman making over $50K

In [371]:
Bach_50m = 3256/3846
Bach_50m

0.8465938637545501

In [372]:
## Ratio of woman making 50K plus to those making 50k or less

In [373]:
WomenPayRatio = Bach_50f/Bach_50m
WomenPayRatio

0.18120393120393122

In [374]:
###Women are less than .2% more likely to make over $50K than their male counterparts

In [375]:
#Regression

In [376]:
from sklearn.linear_model import LogisticRegression
lr = LogisticRegression()

In [385]:
X = handCalc[['age','hours_per_week','Female','Amer-Indian-Eskimo','Asian-Pac-Islander','Black','White','HS-grad','Bachelors',
 'Masters','Doctorate','Never-married', 'Married-AF-spouse']]

In [386]:
y = handCalc['>50K.']

In [387]:
lr.fit(X,y)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [388]:
lr.score(X, y)

0.8029605061114182

In [ ]:
### Thats an OK score right? Lets see if we can make it a little better...seriously just a little though.

In [425]:
X = handCalc[['age','hours_per_week','Female','White','HS-grad','Bachelors',
 'Masters','Doctorate','Never-married', 'Married-AF-spouse']]

In [426]:
lr.fit(X,y)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [427]:
lr.score(X, y)

0.8035747189976046

In [428]:
### I took out education and marital status one at a time. All attempts dropped my score. Only inputing one race actually helped a bit.